<template>
  <div class="detail" style="background: #ffffff">
    <div class="header">
      开发者协议
    </div>
    <div class="content">
      <p class="des">导言</p>
      <p class="des">欢迎您使用本服务！</p>
      <p class="des">为使用数字欢喜的提供的服务（以下简称：本服务），您应当阅读并遵守《开发者协议》（以下简称:本协议）。</p>
      <p class="des">请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议、规则。限制、免责条款可能以加粗形式提示您注意。</p>
      <p class="des">除非您已阅读并接受本协议及相关协议、规则等所有条款，否则，您无权使用本服务。您使用本服务，即视为您已阅读并同意上述协议、规则等的约束。</p>
      <p class="des">您应遵守本协议，否则，数字欢喜有权随时单方限制、中止或终止向您提供本服务，并有权追究您的相关责任。</p>
      <p class="title">1．术语含义</p>
      <p class="title_dec">如无特别说明，下列术语在本协议中的含义为：</p>
      <p class="stepTitle">1.1开发者：指经有效注册、申请后，将自身运营的应用、游戏等上的广告位资源通过接入“本服务”进行销售媒体的个人、法人或其他组织（以下简称“您”）。</p>
      <p class="stepTitle">1.2应用：由开发者运营的，通过SDK等方式接入本服务，为广告提供展示页面、位置的游戏、应用等。</p>
      <p class="stepTitle">1.3广告：通过本服务，在媒体的广告位资源上展示的用于宣传广告主品牌、其生产或销售的商品、服务的信息内容。</p>
      <p class="stepTitle">1.4 SDK接口：指数字欢喜自主研发的移动媒体接口，可将其内嵌到应用中，以实现在应用中展示广告的功能。</p>
      <p class="stepTitle">1.5有效推广收入：指根据应用为广告带来的有效效果量计算出的推广收入。有效效果量，可能会根据点击量、展示量、下载量等不同指标进行计算，具体以数字欢喜在不同服务中确定的相应指标为准，有效效果量=总效果量-无效效果量。</p>
      <p class="stepTitle">1.6数字欢喜平台数据：指用户、开发者在使用本服务过程中产生的相关数据，包括但不限于操作行为形成的数据及各类广告相关数据等。</p>
      <p class="stepTitle">1.7用户：指使用开发者应用的用户。</p>

      <p class="title">2．服务规范</p>
      <p class="stepTitle">
        2.1本协议被视为《数字欢喜服务协议》（链接地址：xxxxxxxxxxxxxxxxxxxxx ，若链接地址变更的，则以变更后的链接地址所对应的内容为准；其他链接地址变更的情形，均适用前述约定）、数字欢喜广告平台相关规则等的补充协议，是其不可分割的组成部分，与其构成统一整体。本协议与上述内容存在冲突的，以本协议为准。</p>
      <p class="stepTitle">2.2本协议内容同时包括数字欢喜可能不断发布的关于本服务的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。</p>
      <p class="stepTitle">2.3您在使用本服务某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），您在使用该项服务前请阅读并同意相关的单独协议。</p>

      <p class="title">3. 开发者的权利和义务</p>

      <p class="stepTitle">3.1帐户注册</p>
      <p class="text">3.1.1您应当通过登录本服务网站（https://media.gladdigit.com），请自行注册开发者帐户（下简称：帐户）使用本服务。</p>
      <p class="text">3.1.2开发者帐户一经注册成功，该帐户不可转让、不可赠与、不可继承等。您应当提交真实、合法、有效的注册信息，包括但不限于身份证、营业执照、收款账号、联系方式等，并应当更新帐户信息确保信息准确有效。您应提供应用相关的真实、准确的资质材料或证明等，否则，数字欢喜有权随时限制、中止或终止向您提供服务。您的相关注册信息发生变化的，在允许变更的范围内应当在变更后3个工作日内修改相关注册信息，并通知数字欢喜，由于您注册信息不准确或未及时更新导致的任何损失或责任由您自行承担。</p>
      <p class="text">3.1.3您不得违反本协议约定将您的帐户用于其他目的。否则，数字欢喜有权随时单方限制、中止或终止向您提供本服务，且未经数字欢喜同意您不得再次使用本服务。</p>
      <p class="text">3.1.4开发者提供的银行帐号应与开发者注册本服务帐户时的主体名称保持一致。开发者银行帐号如有变更，应当在变更后三个工作日内修改相关注册信息，并通知数字欢喜。</p>
      <p class="text">3.1.5若您发现有他人冒用或盗用您的帐户、或任何其他未经您合法授权的情形时，应立即以有效方式通知数字欢喜（包括但不限于提供您的相关身份资料和企业资质、相关事实情况及您的需求等）。数字欢喜收到您的有效请求并核实身份后，会根据不同情况采取相应措施。若您提供的信息不完整，导致数字欢喜无法核实您的身份或数字欢喜无法判断您的需求等，而导致数字欢喜无法进行及时处理，给您带来的损失，您应自行承担。同时，数字欢喜对您的请求采取措施需要合理期限，对于您通知数字欢喜以及数字欢喜根据您的有效请求采取措施之前，由于他人行为给您造成的损失，数字欢喜不承担任何责任。</p>

      <p class="stepTitle">3.2资质证明材料</p>
      <p class="text">
        3.2.1您使用本服务，接入和运营媒体及其提供相关服务等行为均应符合相关法律法规及本协议的要求，您应向数字欢喜提交相应证明材料，以证明您具有经营媒体或提供相关服务的合法资质，或经过了相关政府部门、权利人的批准或同意，包括但不限于资质证明、权利证明及法律法规所要求的相关证明材料。如游戏媒体需提交《增值电信业务许可证》《网络出版服务许可证》、网络游戏出版物号、《软件著作权登记证书》或合法授权证明，以及根据法律法规规定需新增或变更的其他资质材料。</p>
      <p class="text">3.2.2您提交的注册信息应真实、合法、有效，包括但不限于主体资质材料以及应用名称、联系人姓名（名称）、地址、电子邮箱等相关资料。</p>
      <p class="text">
        3.2.3您通过您的应用提供的各种服务，应符合国家相关法规的规定，不违反任何相关法规及相关协议、规则，也不会侵犯任何人的合法权益，同时，应依法、依约或按照数字欢喜的要求提供商标权、著作权、专利权等相关证明文件或合法授权材料。</p>
      <p class="text">3.2.4因您未依法依约提供相关证明材料导致任何处罚、投诉、争议等，数字欢喜有权暂停或终止向您提供本服务，并由您自行承担全部责任。</p>


      <p class="stepTitle">3.3媒体要求</p>
      <p class="text">3.3.1您应自行负责应用本身的创作、开发、编辑、加工、修改、测试、运营及维护等工作，并且自行承担相应的费用及责任。</p>
      <p class="text">3.3.2应用应符合相关法律法规、技术规范或行业标准等，同时，还应符合数字欢喜在技术、安全等方面的统一要求，以确保媒体可以在本服务平台安全、稳定的运营。</p>
      <p class="text">3.3.3您的应用接入本服务之前，需通过本服务的接入测试，测试通过后可依据相关规范、流程等接入到本服务的系统。测试标准以数字欢喜通知的标准为准，数字欢喜有权根据实际需要对测试标准进行修改。</p>
      <p class="text">
        3.3.4您保证对应用享有完整的知识产权或已经依法获得权利人必要的授权，保证媒体及通过应用提供的服务符合法律要求，且不侵犯任何人的合法权益，并依法运营媒体，履行相关义务，自行承担全部责任。</p>
      <p class="text">3.3.5除通过本服务展示的广告以外，您应负责应用的更新、运营和客户服务的工作，若应用进行了修改或更新，则您应根据本服务的要求提交更新产品。</p>
      <p class="text">3.3.6您负责不断完善和优化应用，并通过自有渠道及其他合作渠道，进行应用的推广，为应用增加更多的用户，以带来更多广告的展示和点击。</p>


      <p class="stepTitle">3.4开发者行为规范</p>
      <p class="text">3.4.1开发者应当遵守数字欢喜不定期制定和修改的与本服务有关的运营规则和管理办法等全部规则，并接受相应的考核和规范。您应对广告进行完整的、不间断的展现，并保证不对广告进行任何增加、修改或删剪等任何处理。</p>
      <p class="text">3.4.2经与数字欢喜沟通确认后，您有权在本服务中设置屏蔽广告的关键字信息，并承诺接受除包含该关键字信息以外的其他任何广告。</p>
      <p class="text">3.4.3合作中涉及的任何文档、图片、SDK接口等，您均不得提供或转让给任何第三方，且不得将数字欢喜所提供的信息、内容或服务用于本服务以外的其他目的。</p>
      <p class="text">3.4.4禁止利用任何违法违约手段伪造广告的有效效果量，包括但不限于实施刷机、业务作弊、点击作弊等行为。</p>
      <p class="text">
        3.4.5不得对SDK接口进行反向工程（reverseengineer）、反向编译（decompile）或反汇编（disassemble）；不得对SDK接口进行内容、功能、逻辑及界面等任何方面的修改；不得将SDK接口或业务用于本协议以外目的。</p>
      <p class="text">3.4.6您不得从事任何包括但不限于以下的违反法律法规的行为，也不得为以下行为提供便利（包括但不限于为用户的行为提供便利等）：</p>
      <p class="text_des">（1）反对宪法所确定的基本原则的行为;</p>
      <p class="text_des">（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的行为;</p>
      <p class="text_des">（3）损害国家荣誉和利益的行为；</p>
      <p class="text_des">（4）煽动民族仇恨、民族歧视，破坏民族团结的行为；</p>
      <p class="text_des">（5）破坏国家宗教政策，宣扬邪教和封建迷信的行为；</p>
      <p class="text_des">（6）散布谣言，扰乱社会秩序，破坏社会稳定的行为；</p>
      <p class="text_des">（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的行为；</p>
      <p class="text_des">（8）侮辱或者诽谤他人，侵害他人合法权益的行为；</p>
      <p class="text_des">（9）侵害他人知识产权、商业秘密等合法权利的行为；</p>
      <p class="text_des">（10）恶意虚构事实、隐瞒真相以误导、欺骗他人的行为；</p>
      <p class="text_des">（11）发布、传送、传播不良广告信息及垃圾信息；</p>
      <p class="text_des">（12）其他法律法规禁止的行为。</p>
      <p class="text">3.4.7您不得从事包括但不限于以下行为，也不得为以下行为提供便利（包括但不限于为用户的行为提供便利等）：</p>
      <p class="text_des">（1）删除、隐匿、改变本服务显示或其中包含的任何专利、著作权、商标或其他所有权声明；</p>
      <p class="text_des">（2）以任何方式干扰或企图干扰数字欢喜任何产品、任何部分或功能的正常运行，或者制作、发布、传播上述工具、方法等；</p>
      <p class="text_des">（3）除广告显示需要外，未经数字欢喜书面许可，使用任何数字欢喜商标、标识或其任何变体、缩写、改写等；</p>
      <p class="text_des">（4）避开、尝试避开或声称能够避开任何内容保护机制，或导致用户认为其直接与数字欢喜及数字欢喜相关产品进行交互；</p>
      <p class="text_des">（5）除广告显示需要外，在未获得数字欢喜书面许可的情况下，以任何方式使用数字欢喜URL地址、技术接口等；</p>
      <p class="text_des">（6）在未经过用户同意的情况下，向任何其他用户及他方显示或以其他任何方式提供该用户的任何信息；</p>
      <p class="text_des">（7）在没有获得用户或数字欢喜明示同意的情况下，向用户发送骚扰信息，或直接以数字欢喜名义联系用户；</p>
      <p class="text_des">（8）为任何主体自动登录到本服务平台提供代理身份验证凭据；</p>
      <p class="text_des">（9）自动将浏览器窗口定向到其他网页；</p>
      <p class="text_des">（10）未经授权获取对数字欢喜产品或服务的访问权；</p>
      <p class="text_des">（11）应用中含有计算机病毒、木马或其他恶意程序等任何可能危害数字欢喜或用户权益和终端信息安全等的内容；</p>
      <p class="text_des">（12）设置或发布任何违反相关法规、公序良俗、社会公德等的内容、机制等；</p>
      <p class="text_des">（13）公开表达或暗示，您与数字欢喜之间存在合作关系，包括但不限于相互持股、商业往来或合作关系等，或声称数字欢喜对您的认可；</p>
      <p class="text_des">（14）其他数字欢喜认为不应该、不适当的行为、内容。</p>

      <p class="text">3.4.8因应用维护、升级等原因需要暂停投放广告的，您需要至少提前五个工作日以书面形式通知数字欢喜。</p>
      <p class="text">3.4.9无论何种原因导致媒体或相关服务的终止，在终止之前，您都应该依法、依约的妥善解决您与用户之间的相关事项。</p>

      <p class="stepTitle">3.5数字欢喜平台数据规则</p>
      <p class="text">3.5.1本服务涉及的数据的全部权利，均归属数字欢喜所有（法律另有规定除外），且是数字欢喜的商业秘密。未经数字欢喜事先书面同意，您不得为本协议约定之外的目的使用前述数据，亦不得以任何形式将前述数据提供给他人，不得有任何破坏数字欢喜与合作伙伴之间业务关系的行为。</p>
      <p class="text">3.5.2一旦您停止使用本服务，或数字欢喜基于任何原因终止您使用本服务，您必须立即删除全部从数字欢喜获得的数据（包括各种备份），且不得再以任何方式进行使用。</p>
      <p class="text">3.5.3您应自行对因使用本服务而存储在数字欢喜服务器的各类数据等信息，在本服务之外，采取合理、安全的技术措施，确保其安全性，并对自己的行为（包括但不限于采取加密措施或进行其他安全措施等）所引起的结果承担全部责任。</p>
      <p class="text">3.5.4为向您提供本服务，数字欢喜可能需要收集或使用部分媒体用户的个人信息，您应保证自行获得用户的授权，同意您、数字欢喜或其他第三方因广告业务收集或使用媒体用户的个人信息，授权方式包括但不限于通过用户点击确认您媒体的隐私政策、弹窗告知等。若您未能获得用户授权同意，您应按照数字欢喜的要求及时通知数字欢喜，并配合数字欢喜进行相关操作以保护用户的个人信息。</p>
      <p class="text">3.5.5您应保证在您媒体的隐私政策等协议中，按照数字欢喜的要求告知用户本服务SDK收集及使用用户个人信息的情况，或通过链接等方式向用户展示本服务SDK的隐私政策。</p>

      <p class="stepTitle">3.6法律责任</p>
      <p class="text">3.6.1您违反法律法规，或因违规操作所引发的全部责任，由您独立承担。开发者同意和理解：</p>
      <p class="text_des">（1）应用由您独立运营并独立承担全部责任。数字欢喜不会、也不可能参与您对应用的研发、运营等任何活动，数字欢喜也不会对开发者的应用产品进行任何的修改、编辑或整理等。</p>
      <p class="text_des">（2）数字欢喜自主开发并独立享有SDK接口的知识产权等合法权益，开发者仅在本服务范围内进行使用</p>
      <p class="text_des">（3）因开发者原因导致的任何纠纷、责任等，以及开发者违反相关法律法规或本协议约定引发的任何后果，均由开发者独立承担责任、赔偿损失，与数字欢喜无关。如侵害到数字欢喜或他人权益的，开发者须自行承担全部责任和赔偿一切损失。</p>
      <p class="text">3.6.2如因本服务使用的第三方软件或技术引发的任何纠纷，由该第三方负责解决。</p>
      <p class="text">3.6.3若数字欢喜自行发现或根据相关部门的信息、权利人的投诉等发现您可能违反本协议的，数字欢喜有权根据一般人的认识自己独立判断，以认定您是否存在违约情况，若数字欢喜经过判断认为您违约的，数字欢喜有权随时单方采取以下一项或多项措施。</p>
      <p class="text_des">（1）要求您立即更正违约行为；</p>
      <p class="text_des">（2）对违约行为相关的媒体或您名下的全部媒体或任何其他任何一款媒体中止或终止服务；</p>
      <p class="text_des">（3）禁止您今后将您的任何新媒体接入本服务；</p>
      <p class="text_des">（4）对涉嫌违约的媒体单独或者您名下的全部媒体或其他任何一款媒体中止或终止结算推广费用；</p>
      <p class="text_des">（5）追究您的法律责任；</p>
      <p class="text_des">（6）将您的行为对外予以公告；</p>
      <p class="text_des">（7）其他数字欢喜认为适合的处理措施。</p>
      <p class="text">3.6.4若数字欢喜按照上述条款、本协议的其他相关约定或因您违反相关法律的规定，对您或您的媒体采取任何行为或措施，所引起的纠纷、责任等一概由您自行负责，造成您损失（包括但不限于服务中断、未结算推广费用作为违约金而归数字欢喜所有等）的，您应自行全部承担，造成数字欢喜或他人损失的，您也应自行承担全部责任。</p>
      <p class="text">3.6.5如您对违约处罚有异议的，应在收到处罚通知的三个工作日内，按照数字欢喜提供的正确联系方式进行申述。如无申诉或逾期申诉，视为您认可数字欢喜的处罚结果。尽管有前述规定，数字欢喜有权单方决定是否接受申诉。</p>

      <p class="title">4．数字欢喜的权利和义务</p>
      <p class="stepTitle">4.1数字欢喜会根据您选择的服务以及结算方式等情况向您提供相应的服务。</p>
      <p class="stepTitle">4.2保护您的信息的安全是数字欢喜的一项基本原则，未经您的同意，数字欢喜不会向数字欢喜以外的任何公司、组织和个人披露、提供您的信息，但下列情形除外：</p>
      <p class="text">（1）据本协议或其他相关协议、规则等规定可以提供的；</p>
      <p class="text">（2）依据法律法规的规定可以提供的；</p>
      <p class="text">（3）行政、司法等政府部门要求提供的；</p>
      <p class="text">（4）您同意数字欢喜向第三方提供，且未违反任何法律法规；</p>
      <p class="text">（5）为解决投诉或举报事件、解决诉讼纠纷而需要提供的；</p>
      <p class="text">（6）为防止严重违法行为或涉嫌犯罪行为发生而采取必要合理行动所必须提供的。</p>
      <p class="stepTitle">4.3尽管数字欢喜对您的信息保护做了极大的努力，您的信息仍可能会因为不可抗力或非数字欢喜原因造成泄漏、窃取等，由此给您造成损失的，您同意数字欢喜可以免责。</p>
      <p class="stepTitle">4.4数字欢喜可将本协议下的权利和义务的部分或全部转让给他人，如果您不同意数字欢喜的该转让，则有权停止使用本服务。否则，视为您对此予以接受。</p>
      <p class="stepTitle">4.5除本协议约定的推广收入，数字欢喜无需为按照本协议享有的其他权益而向您支付任何费用。</p>
      <p class="stepTitle">4.6您理解并同意：为实现互惠互利，数字欢喜有权为推广本服务目的使用您及应用的LOGO、标识、名称、图片等相关素材。</p>
      <p class="stepTitle">4.7数字欢喜负责广告的接入、审核及运营管理。数字欢喜根据广告主的推广需求及您的设置，在媒体中推送广告。</p>
      <p class="stepTitle">4.8数字欢喜负责提供本服务的技术实现方案，并负责研发并向您提供SDK接口、相关文档与技术支持。您应根据数字欢喜要求在应用中内嵌该SDK接口。</p>
      <p class="stepTitle">4.9数字欢喜有权对您提交的媒体进行审核、测试和安全扫描。若媒体未通过测试，则您须修改后再次提交。若同一媒体的同一版本提交三次仍未通过测试，则数字欢喜有权终止该媒体接入本服务。</p>
      <p class="stepTitle">4.10数字欢喜负责向您提供推广数据查询统计系统，该系统可供您查询广告在媒体中的包括但不限于展示次数、点击次数、收入情况等信息。</p>
      <p class="stepTitle">4.11数字欢喜负责保障本服务及推广数据查询统计系统的开发、运营和维护，并保障该系统服务的连续性和稳定性。若由于非数字欢喜原因造成的系统服务的故障、间断和延时，则数字欢喜不承担责任。</p>
      <p class="stepTitle">4.12数字欢喜保证不对媒体进行反向工程（reverseengineer）、反向编译（decompile）或反汇编（disassemble），保证不对您提供的媒体进行功能和逻辑等方面的修改或进行除本服务以外的其他内容和界面的修改。</p>
      <p class="stepTitle">4.13数字欢喜有权根据本服务的实际运营情况单方制定和修改本服务规则，并依据相应的规则和办法对您及您的媒体进行考核和规范。</p>

      <p class="title">5．推广费用计算与结算</p>
      <p class="stepTitle">
      5.1数字欢喜可能根据实际需要对费用的结算政策进行修改和变更，前述修改、变更前，数字欢喜将在相应服务页面进行通知或公告，具体按每月实际执行政策确定，您应当予以遵守。如果您不同意上述修改、变更，则应停止使用相应服务，否则，您的任何使用行为，即视为您同意上述修改、变更。
       </p>
      <p class="stepTitle">5.2费用结算</p>
      <p class="text">5.2.1数字欢喜将根据媒体为广告带来的有效效果量，计算应向您结算的推广收入，该推广收入含税。</p>
      <p class="text">5.2.2如您是自然人（国内个人）：向您应结算的推广收入包含您应缴纳的所有税费。数字欢喜已取得主管税务机关的许可，代征您的增值税及附加（包括城市维护建设税、教育费附加以及地方教育附加）。数字欢喜也将基于合同约定的支付时点按现行有效的法规，履行个人所得税的扣缴义务。您的实收金额为约定结算的推广收入金额扣减数字欢喜代征的增值税和附加税费，以及为您代扣代缴个人所得税后的剩余金额。双方确认您需自行履行年底个人所得税综合申报义务，以及自行承担个税税款的多退少补，您个税税款的调整或其他相关税费的缴纳（如有）与数字欢喜无关。
       </p>
      <p class="text">5.2.3如您是企业开发者：数字欢喜按照5.2.1的含税推广收入结算，并实际支付。企业开发者应根据有效推广收入，按照国家相关法律法规自行履行纳税义务。</p>
      <p class="stepTitle">5.3费用确认</p>
      <p class="text">5.3.1开发者收益每自然月结算一次。开发者确认并同意，展示次数、点击次数、有效效果量、有效推广收入等数据，均以数字欢喜系统相应的统计数据为准，开发者对此无异议。</p>
      <p class="text">
        5.3.2您应在每月20日之前（遇节假日顺延）将上个自然月的在数字欢喜管理系统查询到的您的收益等相关数据的对账单打印出来加盖公章（自然人签字），并将前述加盖公章（自然人签字）的对账单、相应合格发票（自然人无需提供发票）一同按照数字欢喜指定的地址和收件人等邮寄给数字欢喜。</p>
      <p class="text">5.3.3双方应依法承担各自应当缴纳的各种税费费用，涉及代扣代缴或代征的，数字欢喜有权代扣代缴或代征。</p>
      <p class="stepTitle">5.4费用支付</p>
      <p class="text">5.4.1您有权依照本服务相关规则指定收款银行账户。</p>
      <p class="text">5.4.2数字欢喜依本协议所应支付您的收益之所有款项，将在收到您出具的合格发票、盖章确认的对账单等凭证后30个工作日内以电汇方式直接汇入您的银行账户。</p>
      <p class="text">5.4.3相关文件中（包括但不限于主协议、补充协议及其规则、规范等）如无特别说明，所有涉及到的费用均以人民币为计价单位。</p>


      <p class="title">6．反作弊和清廉条款</p>
      <p class="stepTitle"> 6.1您保证遵守本服务的相关服务规则，在合作过程中不得出现如下行为：</p>

      <p class="text">6.1.1制造无效流量（如：自行访问、鼓励访问、程序访问等）。</p>

      <p class="text">6.1.2制造无效点击：</p>

      <p class="text_des">（1）自己点击：用户本人或者煽动他人进行反复手动点击；</p>

      <p class="text_des">（2）强制和鼓励用户点击：以任何资源交换为目引导用户点击；</p>

      <p class="text_des">（3）通过程序软件点击：通过作弊程序，自动点击来增加无效数据。</p>

      <p class="text">6.1.3违规嵌入：</p>

      <p class="text_des">（1）出现诱导、引导用户对任意广告进行点击字样；</p>

      <p class="text_des">（2）广告遮盖媒体操作元素，影响用户正常操作；</p>

      <p class="text_des">（3）同一媒体界面嵌入多条广告，遮盖媒体界面，严重影响用户正常观看。</p>

      <p class="text">6.1.4违反本服务规则要求进行违规投放（如：改变形式、遮挡内容等）。</p>

      <p class="text">6.1.5出现违反本协议或国家法律、法规及其他法律规范性文件的作弊情形。</p>

      <p class="text">6.1.6其他以任何不正当方式制造虚假或无效流量、点击量、下载量等，或违规嵌入等任何行为。</p>

      <p class="stepTitle">6.2数字欢喜有权不定期制定和调整相应的反作弊管理及处罚规范，相关规范作为本协议不可分割的组成部分，与其构成统一整体。</p>


      <p class="title">7．关于免责</p>
      <p clss="title_dec">您理解并同意，若出现以下情形，您同意放弃追究数字欢喜责任：</p>
      <p class="stepTitle">7.1鉴于网络服务的特殊性或国家政策、行业规定的调整、变化等，数字欢喜有权根据本服务的整体运营情况或相关运营规范、规则等，随时变更、中止或终止部分或全部的服务。</p>
      <p class="stepTitle">7.2为了向您提供更完善的服务，数字欢喜有权定期或不定期地对提供本服务的平台或相关设备进行检修、维护、升级等，此类情况可能会造成相关服务在合理时间内中断或暂停的。</p>
      <p class="stepTitle">7.3数字欢喜的服务是按照现有技术和条件所能达到的现状提供的。数字欢喜会尽最大努力向您提供服务，确保服务的连贯性和安全性；但数字欢喜不能保证其所提供的服务毫无瑕疵，也无法随时预见和防范法律、技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。所以您也同意：即使数字欢喜提供的服务存在瑕疵，但上述瑕疵是当时行业技术水平所无法避免的，其将不被视为数字欢喜违约，同时，由此给您造成的数据或信息丢失等损失的，您同意放弃追究数字欢喜的责任。出现上述情况时，数字欢喜将努力在第一时间与相关单位配合，及时进行修复，若由此给您造成损失的，您同意放弃追究数字欢喜的责任。</p>
      <p class="stepTitle">7.4对以下情形导致的服务中断或终止，给您造成损失的，您同意放弃追究数字欢喜的责任：</p>

      <p class="text">（1）受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；</p>

      <p class="text">（2）您或数字欢喜的电脑软件、系统、硬件和通信线路出现故障；</p>

      <p class="text">（3）您的违规操作或其他不当行为；</p>

      <p class="text">（4）您通过非数字欢喜授权的方式使用本服务；</p>

      <p class="text">（5）其他数字欢喜无法控制或合理预见的情形。</p>

      <p class="title">8．关于通知</p>
      <p class="stepTitle">8.1数字欢喜可能会以网页公告、网页提示、电子邮箱、手机短信、常规的信件传送、您注册的本服务帐户的管理系统内发送站内信等方式中的一种或多种，向您送达关于本服务的各种规则、通知、提示等信息，该等信息一经数字欢喜采取前述任何一种方式公布或发送，即视为您已经接受并同意，对您产生约束力。若您不接受的，请您立即终止使本服务并书面通知数字欢喜，否则视为您已经接受、同意。</p>
      <p class="stepTitle">8.2若由于您提供的电子邮箱、手机号码、通讯地址等信息错误，导致您未收到相关规则、通知、提示等信息的，您同意仍然视为您已经收到相关信息并受其约束，一切后果及责任由您自行承担。</p>
      <p class="stepTitle">8.3您也同意数字欢喜可以向您的电子邮件、手机号码等发送可能与本服务相关或不相关的其他各类信息包括但不限于商业广告等。</p>
      <p class="stepTitle">8.4若您有事项需要通知数字欢喜的，应当按照本服务对外正式公布的联系方式书面通知数字欢喜。</p>


      <p class="title">9．知识产权</p>
      <p class="stepTitle">
        9.1数字欢喜在本服务中提供的信息内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权均归数字欢喜所有，依法属于他人所有的除外。除另有特别声明外，数字欢喜提供本服务时所依托软件的著作权、专利权及其他知识产权均归数字欢喜所有。数字欢喜在本服务中所使用的“数字欢喜”商业标识，其著作权或商标权归数字欢喜所有。上述及其他任何数字欢喜依法拥有的知识产权均受到法律保护，未经数字欢喜书面许可，您不得以任何形式进行使用或创造相关衍生作品。</p>
      <p class="stepTitle">
        9.2您仅拥有依照本协议约定合法使用本服务或相关SDK接口的权利，与本服务相关的SDK接口相关的著作权、专利权等相关全部权利归数字欢喜所有。未经数字欢喜书面许可，您不得违约或违法使用，不得向任何单位或个人出售、转让、授权数字欢喜的代码、SDK接口及开发工具等。</p>


      <p class="title">10．有效期限和终止</p>
      <p class="stepTitle">10.1协议期间</p>
      <p class="text">10.1.1除本协议约定终止之情形外，本协议将会一直有效。</p>
      <p class="text">10.1.2如一方违反本协议，致使本协议无法继续履行或继续履行已经无法达到签约目的或该违反本协议的行为已经侵害了另一方的合法权益，另一方须提前10日以书面形式通知对方终止协议。</p>
      <p class="text">
        10.1.3协议生效期间如遇国家法律、法规、国家相关部门及电信运营商有新相关文件出台或政策环境产生变化，致使本协议之签订、履行基础产生根本性变化的，任何一方可通知对方协商变更原协议；若协商不成，一方可在提前10日通知对方的情况下终止协议并不承担任何责任。</p>
      <p class="stepTitle">10.2终止之情形</p>
      <p class="text">10.2.1任何一方宣布破产或进入清算或解散程序。</p>
      <p class="text">10.2.2因不可抗力因素导致您无法继续使用本服务或数字欢喜无法提供本服务的，任何一方均有权随时终止协议。</p>
      <p class="text">10.2.3如您不接受本协议内容或数字欢喜对其的修改，或者您不接受本服务规则或其修改内容，您有权随时终止本协议。</p>
      <p class="text">10.2.4数字欢喜有权根据整体运营安排，随时单方终止本服务，终止本协议。</p>
      <p class="text">10.2.5由于您违反本协议约定，数字欢喜依约终止向您提供本服务后，如您后续再直接或间接，或以他人名义注册使用本服务的，数字欢喜有权直接单方面暂停或终止提供本服务。</p>
      <p class="text">10.2.6本协议约定的其他终止条件发生或实现的，数字欢喜有权随时终止向您提供本服务。</p>
      <p class="stepTitle">10.3终止后之事项</p>
      <p class="text">10.3.1本协议之终止并不影响本协议项下未完成之结算或任何一方之付款义务以及其它在终止之日前已产生的义务或权利。</p>
      <p class="text">10.3.2如本协议或本服务因为任何原因终止的，对于您帐户中的全部数据或您因使用本服务而存储在数字欢喜服务器中的数据等任何信息，数字欢喜可将该等信息保留或删除，包括服务终止前您尚未完成的任何数据。</p>
      <p class="text">10.3.3如本协议或本服务因为任何原因终止的，您应自行处理好关于数据等信息的备份以及与您的用户之间的相关事项的处理等。</p>


      <p class="title">11．其它</p>
      <p class="stepTitle">11.1本协议内容同时包括数字欢喜的各项制度规范、其它本协议附件中的协议或规则、数字欢喜可能不断发布的关于本服务的其他相关协议、规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。上述内容与本协议存在冲突的，以本协议为准。一经注册或使用本协议下任何服务，即视为您已阅读并同意接受本协议及上述内容的约束。数字欢喜有权在必要时单方修改本协议或上述内容，相关内容变更后，如果您继续使用本服务，即视为您已接受修改后的相关内容。如果您不接受修改后的相关内容，应当停止使用相关服务。</p>
      <p class="stepTitle">11.2本协议签订地为中华人民共和国北京市。本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</p>
      <p class="stepTitle">11.3若您和数字欢喜之间发生任何纠纷或争议，首先应友好协商解决；协商不成功的，双方均同意将纠纷或争议提交本协议签订地有管辖权的人民法院解决。</p>
      <p class="stepTitle">11.4本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。（完）</p>


      <p style="margin:40px 0 20px">北京数字欢喜科技有限公司</p>
    </div>
  </div>
</template>

<script>
export default {
    name: 'developer'
}
</script>

<style lang="stylus" scoped>
  .detail{
      background #fff
      padding 0px 40px
    .header{
      color: #000000;
      height: 60px;
      line-height: 60px;
      padding-left: 25px;
      border-bottom: 1px solid #dddddd;
      text-align: left;
      font-size: 20px;
      font-weight: bold;
    }
    .content {
      text-align: left;
      padding: 20px;
      p{
        line-height: 32px;
        &.des{
          font-size 14px
          color black
        }
        &.title_dec{
          font-size:14px;
          color: #9ea7b4;
        }
        &.title{
          font-size: 16px;
          color: black;
        }
        &.stepTitle{
          font-size: 15px;
          color: #464c5b;
          padding-left: 8px;
        }
        &.text{
          font-size: 14px;
          color: #464c5b;
          padding-left: 16px;
        }
        &.text_des{
          font-size: 14px;
          color: #657180;
          padding-left: 20px;
        }
      }

    }
  }

</style>
